app/Models/Language.php

    public static function getDefault()
    {
        return static::where('is_default', true)->first();
---
select * from `languages` where `is_default` = 1 limit 1